{
  "nav.home": "الرئيسية",
  "nav.about": "عنّي",
  "nav.projects": "المشاريع",
  "nav.contact": "اتصل",

  "home.welcome": "مرحبًا! أنا سعيد علي شاهبازي.",
  "home.description": "أنا مطور خلفي وأمامي أركز على JavaScript وNode.js وPython. بالنسبة لي، البرمجة تتجاوز مجرد كتابة الكود؛ فهي عن إنشاء حلول دقيقة، قابلة للصيانة وموثوقة لمواجهة تحديات العالم الحقيقي.\n\nلقد أوليت دائمًا أولوية لكتابة كود نظيف، منظم وموثق جيدًا. أستخدم Git وGitHub بشكل احترافي، مع تنفيذ تغييرات ذات مغزى والحفاظ على فروع منظمة.\n\nأصمم أنظمة قابلة للتوسع، سهلة الصيانة وسهلة الفهم. تشمل مهاراتي تطوير واجهات برمجة التطبيقات، إدارة قواعد البيانات، والتوثيق المهني.\n\nهدفي هو الهجرة وإقامة عمل في الخارج، أبحث عن بيئة مهنية تمكنني من النمو ومتابعة فرص مبتكرة.\n\nأقدر التعاون المبني على الجودة، الشفافية والاحترام المتبادل.",

  "about.title": "عنّي",
  "about.name": "سعيد علي شاهبازي",
  "about.roles": "مطور خلفي وأمامي | متحمس للتوثيق | باحث عن التميز",
  "about.birthdate": "تاريخ الميلاد: 10 نوفمبر 1998",
  "about.greeting": "تحياتي. أنا لست مجرد مطور، بل باحث يستكشف العمق المعماري للأنظمة والوعي والإبداع.",
  "about.childhood": "منذ الصغر، جذبني الفُرَص الخفية التي تحكم الواقع — سواء كانت أنظمة منطقية في الحواسيب أو أنماط أرشيفية داخل النفس. تابعت التكنولوجيا والحقيقة الداخلية بنفس الفضول.",
  "about.learningPath": "مسار تعلمي",
  "about.learningDesc": "بدأت رحلتي بالغوص العميق في تقنيات الخلفية، بدءًا بـ Node.js وتوسعت إلى Python. تعلمت كيف أبني واجهات برمجة التطبيقات، أتعامل مع قواعد البيانات، وأؤتمت سير العمل — بالإضافة إلى كتابة كود مستدام، قابل للقراءة وقابل للاختبار.",
  "about.tools": "أنا متمرس في استخدام Git وGitHub وPostman وVS Code وLinux وREST APIs ومدراء الحزم مثل npm/yarn/pip. أعطي أولوية للالتزامات النظيفة، التفرعات المعنوية، والتوثيق الدقيق كجزء من أخلاقيات المطور.",
  "about.pythonDesc": "أصبحت Python لغة قوية ثانية في مجموعتي التقنية. أستخدمها للأتمتة، سير العمل الخلفي، وقريبًا للمهام المتعلقة بالبيانات (أنابيب ETL، السكريبتات وتحويل البيانات).",
  "about.beliefsTitle": "المعتقدات والقيم",
  "about.beliefsDesc": "بالنسبة لي، التطوير ليس مجرد مهنة — بل هو طريق الوضوح، الانضباط، والاندماج. أتعامل مع قواعد الكود ككائنات حية: تحتاج إلى رعاية، تواصل، وبنية واعية. أؤمن بالنمو من خلال البنية، العمل الداخلي، وإعادة البناء المستمرة — للكود والنفس على حد سواء.",
  "about.devMeans": "ماذا يعني التطوير لي",
  "about.commitment": "ألتزم بكتابة كود نظيف، معياري وقابل للتوسع يتماشى مع احتياجات المستخدم والصيانة طويلة الأمد.",
  "about.communication": "أقدر التواصل الواضح، المحترم والموجه نحو الحلول المشتركة.",
  "about.responsibility": "أتحمل مسؤولية الأنظمة التي أصممها وأعمل على تحسينها باستمرار بوعي ونية.",
  "about.goalsTitle": "الرؤية والأهداف المستقبلية",
  "about.goalsDesc": "هدفي بناء مسيرة مهنية مستقلة عن المكان ومرتكزة روحانيًا. أبحث عن تعاونات حرة ووظائف عن بعد تتماشى مع الابتكار والجودة والانسجام الأخلاقي.",
  "about.environmentDesc": "أسعى للانضمام إلى فرق حيث الاستقلالية الإبداعية، التعلم المنظم، والسلامة النفسية هي القاعدة. أهتم بشكل خاص بالبيئات متعددة الثقافات والأنظمة التي تدعم العمل الواعي.",
  "about.whyWorkWithMeTitle": "لماذا تعمل معي؟",
  "about.whyWorkWithMe1": "أدمج الدقة التقنية مع العمق الفلسفي والوضوح النفسي.",
  "about.whyWorkWithMe2": "أجلب تركيزًا مستقلًا وانفتاحًا تعاونيًا لكل مشروع.",
  "about.whyWorkWithMe3": "أقدم كودًا عالي الجودة بعقلية طويلة الأمد واهتمام بالتفاصيل.",
  "about.whyWorkWithMe4": "أهتم بعمق بالعمل ذي المعنى، النمو المتبادل، والنتائج المتناسقة.",

  "projects.title": "مشاريعي",
  "projects.intro": "هنا ستجد مجموعة مختارة من مشاريعي الرئيسية، كل منها مُعد بعناية لحل تحديات العالم الحقيقي وتقديم تأثير مستدام من خلال تطوير خلفي وأمامي قوي.",

  "projects.project1.title": "dr-rezvani-vet.ir",
  "projects.project1.description": "صممت وطورت الحل الكامل للكلينيك البيطري د. رضواني، مقدماً منصة متعددة اللغات تمكّن أصحاب الحيوانات الأليفة من الوصول السهل إلى الخدمات البيطرية. يتميز المشروع بتصميم متجاوب بالكامل، نظام حجز مواعيد بديهي، وواجهة مستخدم نظيفة متوافقة مع هوية العيادة. الخلفية تعتمد على Node.js وPython لضمان قابلية التوسع، الأمان، وتكامل API سلس.",
  "projects.project1.link": "زيارة الموقع",

  "projects.project2.title": "واجهة برمجة الدردشة اللحظية (Node.js وWebSockets)",
  "projects.project2.description": "طورت خلفية دردشة عالية الأداء وقابلة للتوسع باستخدام تقنية WebSocket، تُمكّن من وجود المستخدم في الوقت الحقيقي، حفظ الرسائل، ونقاط نهاية RESTful قوية. تدعم هذه الواجهة تفاعلًا سلسًا بين العملاء مع إدارة حالة فعالة وتحمل الأخطاء.",

  "projects.project3.title": "سكريبتات أتمتة البيانات (Python)",
  "projects.project3.description": "أنشأت مجموعة من سكريبتات Python لأتمتة سير العمل في معالجة البيانات المهمة، بما في ذلك تحليل ملفات CSV، أنابيب ETL، ومهام النشر. تقلل هذه الأدوات بشكل كبير من الجهد اليدوي بينما تزيد من الموثوقية والاتساق في العمليات الخلفية.",

  "projects.project4.title": "لوحة تحكم تفاعلية (الواجهة الأمامية)",
  "projects.project4.description": "بنيت تطبيق لوحة تحكم حديثة ومتجاوبة باستخدام أطر عمل JavaScript المتقدمة. تدمج اللوحة بيانات API ديناميكية، رسوم بيانية بصرية، ومكونات UI تفاعلية لتقديم رؤى تجارية قابلة للتنفيذ مع تجربة مستخدم سلسة.",

  "contact.description": "لا تتردد في التواصل لمناقشة المشاريع، التعاونات، أو أي أسئلة.",
  "contact.form.name": "الاسم",
  "contact.form.email": "البريد الإلكتروني",
  "contact.form.message": "الرسالة",
  "contact.form.submit": "إرسال",

  "contact.featuredProject.title": "المشروع المميز: عيادة الدكتور رضواني البيطرية",
  "contact.featuredProject.description": "طورت الخلفية والهندسة العامة لموقع عيادة الدكتور رضواني البيطرية. يتيح الموقع لأصحاب الحيوانات الأليفة الوصول بسهولة إلى الخدمات البيطرية، جدولة المواعيد، والموارد التعليمية. شملت دوري إنشاء خلفية قابلة للتوسع باستخدام Node.js وPython، وضمان تكامل API سلس، وتعامل آمن مع البيانات."
}
