{
  "nav.home": "الرئيسية",
  "nav.about": "من أنا",
  "nav.projects": "المشاريع",
  "nav.contact": "تواصل معي",

  "home.welcome": "مرحبًا! أنا سعيد علي شهبازي.",
  "home.description": "أنا مطوّر للواجهات والخلفيات أعمل باستخدام تقنيات حديثة. بالنسبة لي، كتابة الشيفرة ليست مجرد عمل تقني، بل فنّ لبناء حلول واقعية ودقيقة يمكن تطويرها وصيانتها.\n\nأكتب شيفرة منظمة ومشروحة. أستخدم أدوات التعاون وإدارة التغييرات باحتراف. أركّز على بناء أنظمة مرنة وسهلة الفهم والصيانة.\n\nهدفي هو السفر والعمل في بيئة تشجع على التطور وتمنح فرصًا حقيقية.\n\nأؤمن بالتعاون المبني على الجودة والاحترام والنية الصادقة.",

  "about.title": "من أنا",
  "about.name": "سعيد علي شهبازي",
  "about.roles": "مطوّر للأنظمة | عاشق للترتيب والتوثيق | ساعٍ نحو الإتقان",
  "about.birthdate": "تاريخ الميلاد: ١٠ نوفمبر ١٩٩٨",
  "about.greeting": "مرحبًا بك. أنا لست مجرد مبرمج، بل إنسان يبحث في عمق الأنظمة والوعي والمعنى.",
  "about.childhood": "منذ الطفولة، كنت منجذبًا إلى البنى الخفية التي تشكّل الواقع – سواء في التقنية أو في النفس.",
  "about.learningPath": "طريق التعلّم",
  "about.learningDesc": "بدأت رحلتي بالتعمّق في نظم التطوير الخلفية، وتعلمت كيفية بناء خدمات، التعامل مع البيانات، وكتابة شيفرة قابلة للاختبار والصيانة.",
  "about.tools": "أتقن استخدام أدوات إدارة الشيفرة، التوثيق، الاختبار، وتصميم الواجهات بطريقة منظمة وواضحة.",
  "about.pythonDesc": "أستخدم أدوات متنوعة في مهام المعالجة والأتمتة، وسأنتقل لاحقًا للعمل بمجال تحليل البيانات.",
  "about.beliefsTitle": "القيم والمبادئ",
  "about.beliefsDesc": "البرمجة بالنسبة لي ليست وظيفة بل طريق، طريق الترتيب، الانضباط، والنمو الواعي. أتعامل مع كل مشروع ككائن حيّ يحتاج إلى وضوح واتصال حقيقي.",
  "about.devMeans": "ماذا تعني لي البرمجة؟",
  "about.commitment": "ألتزم بكتابة شيفرة نظيفة، قابلة للتوسع، ومدروسة من جميع الجوانب.",
  "about.communication": "أقدّر التواصل الواضح، المحترم، والمبني على النوايا الطيبة.",
  "about.responsibility": "أتحمّل المسؤولية الكاملة تجاه الأنظمة التي أُنشئها وأسعى لتحسينها باستمرار.",
  "about.goalsTitle": "الرؤية والطموح",
  "about.goalsDesc": "أطمح إلى مسيرة عمل حرة ومستقلة ذات معنى عميق. أبحث عن فرص عمل تدمج بين الجودة والتعاون والوعي.",
  "about.environmentDesc": "أفضل العمل في بيئات تتيح الإبداع، التعلم المستمر، والهدوء الداخلي. أهتم بالفرق المتنوعة ثقافيًا التي تعمل باحترام وانسجام.",
  "about.whyWorkWithMeTitle": "لماذا تختار العمل معي؟",
  "about.whyWorkWithMe1": "أدمج بين الدقة في العمل والعمق في الرؤية والصفاء في النفس.",
  "about.whyWorkWithMe2": "أوفر توازنًا بين الاستقلالية والتعاون الواعي.",
  "about.whyWorkWithMe3": "أنتج شيفرة عالية الجودة مبنية على تفكير عميق.",
  "about.whyWorkWithMe4": "أبحث عن نتائج منسجمة مع القيم الإنسانية والنية الطيبة.",

  "projects.title": "مشاريعي",
  "projects.intro": "هذه مجموعة من الأعمال التي طورتها بإتقان، وتشمل بناء الأنظمة من الخلف إلى الواجهة، استنادًا إلى طلبات حقيقية من عملاء.",

  "projects.project1.title": "عيادة الدكتور رضواني",
  "projects.project1.description": "تصميم وتطوير واجهة ومحتوى لموقع عيادة بيطرية متخصصة في طب الأسنان. يشمل التصميم دعم اللغات، نموذج الحجز، وهيكلية بسيطة تتماشى مع هوية العيادة.",
  "projects.project1.link": "زيارة الموقع",

  "projects.project2.title": "نظام تواصل لحظي",
  "projects.project2.description": "نظام دردشة متكامل يدعم الاتصال الفوري، تتبّع المستخدمين، حفظ الرسائل، ونقاط تفاعل لخدمة الأنظمة الخارجية.",

  "projects.project3.title": "أدوات أتمتة للبيانات",
  "projects.project3.description": "مجموعة من الأدوات التي تقوم بتنظيف وتحويل البيانات من ملفات مختلفة، تسهّل التهيئة والنشر التلقائي.",

  "projects.project4.title": "لوحة عرض البيانات",
  "projects.project4.description": "لوحة تفاعلية لعرض المعلومات، تحتوي على رسوم بيانية وعناصر حيوية تقدم رؤية فورية لمحتوى النظام.",

  "contact.description": "لا تتردد في التواصل معي لطلب تنفيذ مشروع، التعاون، أو الاستفسارات العامة.",
  "contact.form.name": "الاسم",
  "contact.form.email": "البريد الإلكتروني",
  "contact.form.message": "الرسالة",
  "contact.form.submit": "إرسال",

  "contact.featuredProject.title": "مشروع مميز: عيادة الدكتور رضواني",
  "contact.featuredProject.description": "قمت ببناء الهيكل الكامل لموقع العيادة، بما يشمل المعالجة الخلفية والربط الآمن للبيانات. الموقع يساعد أصحاب الحيوانات في الحصول على الخدمة بسهولة وحجز المواعيد بشكل مباشر."
}
