{
  "nav.home": "الصفحة الرئيسية",
  "nav.about": "من أنا",
  "nav.projects": "المشاريع",
  "nav.contact": "اتصل بي",

  "home.welcome": "مرحبًا! أنا سعيد علي شهبازي.",
  "home.description": "أنا مطوّر خلفي متخصص في JavaScript وNode.js وPython. بالنسبة لي، البرمجة ليست مجرد كتابة كود، بل هي فنّ لصناعة حلول دقيقة، قابلة للصيانة، وموثوقة للتحديات الواقعية.\n\nأولي اهتمامًا بالغًا بكتابة كود نظيف ومنظم وموثق جيدًا. أستخدم Git وGitHub باحتراف، وأقوم بالتزام تغييرات ذات مغزى مع الحفاظ على فروع منظمة.\n\nأصمم أنظمة قابلة للتوسع والصيانة وسهلة الفهم. تشمل مهاراتي تطوير واجهات برمجية، إدارة قواعد البيانات، وإنشاء توثيق احترافي.\n\nهدفي هو الهجرة وبناء مستقبل مهني في بيئة داعمة للنمو والابتكار.\n\nأقدّر التعاون القائم على الجودة والشفافية والاحترام المتبادل.",

  "about.title": "من أنا",
  "about.name": "سعيد علي شهبازي",
  "about.roles": "مطوّر خلفي | عاشق للتوثيق | باحث عن الإتقان والتحوّل",
  "about.birthdate": "تاريخ الميلاد: 10 نوفمبر 1998",

  "about.greeting": "تحية طيبة. لست فقط مطورًا، بل باحثًا يستكشف البنية العميقة للأنظمة، والوعي، والإبداع.",
  "about.childhood": "منذ الطفولة، كنت مفتونًا بالبنى غير المرئية التي تشكّل الواقع — سواء في أنظمة الحواسيب أو في أنماط النفس البشرية. قادني هذا الفضول إلى التكنولوجيا كما إلى البحث الداخلي.",

  "about.learningPath": "طريقي في التعلم",
  "about.learningDesc": "بدأت رحلتي بالغوص في تقنيات التطوير الخلفي، بدءًا من Node.js ثم Python. تعلّمت كيف أطور الواجهات البرمجية، أدير قواعد البيانات، وأبني تدفقات عمل مؤتمتة، إلى جانب كتابة كود مستدام، قابل للقراءة، وقابل للاختبار.",
  "about.tools": "أتقن أدوات مثل Git وGitHub وPostman وVS Code وLinux وREST API ومديري الحزم npm وyarn وpip. أحرص دائمًا على الالتزام بكود نظيف، تنظيم الفروع، وتوثيق دقيق.",
  "about.pythonDesc": "Python هي لغتي الثانية القوية، أستخدمها في الأتمتة، تدفقات العمل الخلفية، وقريبًا في معالجة البيانات وتطوير خطوط ETL.",

  "about.beliefsTitle": "القيم والمعتقدات",
  "about.beliefsDesc": "بالنسبة لي، التطوير ليس مجرد وظيفة، بل طريق للوضوح والانضباط والتكامل. أتعامل مع قواعد الكود كنظم حية تحتاج إلى رعاية وتواصل وتصميم واعٍ. أؤمن بالنمو من خلال البنية، والعمل الداخلي، والمراجعة المستمرة — للكود وللذات.",

  "about.devMeans": "ماذا يعني لي التطوير؟",
  "about.commitment": "ألتزم بكتابة كود نظيف، معياري، وقابل للتوسعة يتماشى مع احتياجات المستخدم وقابلية الصيانة على المدى الطويل.",
  "about.communication": "أقدّر التواصل الواضح، المحترم، والموجّه نحو الحلول المشتركة.",
  "about.responsibility": "أتحمّل مسؤولية الأنظمة التي أصممها، وأسعى لتحسينها باستمرار بنية ووعي.",

  "about.goalsTitle": "الرؤية والأهداف المستقبلية",
  "about.goalsDesc": "أسعى لبناء مسيرة مهنية مستقلة مكانيًا ومرتبطة بالمعنى. أبحث عن فرص عمل حر أو عن بعد تتوافق مع الابتكار والجودة والانضباط الأخلاقي.",
  "about.environmentDesc": "أطمح للانضمام إلى فرق تثمّن الاستقلال الإبداعي، التعلم المنظم، والأمان النفسي — وخصوصًا في بيئات متعددة الثقافات وواعية.",

  "about.whyWorkWithMeTitle": "لماذا تعمل معي؟",
  "about.whyWorkWithMe1": "أدمج بين الدقة التقنية، العمق الفلسفي، والوضوح النفسي.",
  "about.whyWorkWithMe2": "أجمع بين التركيز الذاتي والانفتاح على التعاون.",
  "about.whyWorkWithMe3": "أقدّم حلولًا برمجية عالية الجودة برؤية طويلة المدى واهتمام بالتفاصيل.",
  "about.whyWorkWithMe4": "أهتم بالعمل الهادف، والنمو المشترك، والنتائج المتناغمة.",

  "projects.title": "المشاريع",
  "projects.intro": "فيما يلي مجموعة من مشاريعي التي طُورت بعناية لتلبية احتياجات حقيقية وللحفاظ على قابلية الصيانة على المدى الطويل.",

  "projects.project1.title": "نظام إدارة API",
  "projects.project1.description": "خدمة RESTful تم تطويرها باستخدام Node.js وExpress لإدارة البيانات الديناميكية مع التركيز على القابلية للتوسع والأمان.",

  "projects.project2.title": "أتمتة Backend باستخدام Python",
  "projects.project2.description": "مجموعة من سكريبتات Python لأتمتة معالجة البيانات وسير العمل، بما في ذلك عمليات ETL.",

  "projects.project3.title": "توثيق مشاريع التطوير",
  "projects.project3.description": "إعداد توثيقات شاملة لمشاريع البرمجيات مع التركيز على وضوح المحتوى وسهولة الفهم للمطورين وأصحاب المصلحة.",

  "projects.callToAction": "إذا كنت مهتمًا بالتعاون أو مناقشة مشروع، لا تتردد في الاتصال بي.",

  "contact.title": "اتصل بي",
  "contact.description": "لا تتردد في التواصل لمناقشة المشاريع، التعاون أو أي استفسارات.",

  "contact.form.name": "الاسم",
  "contact.form.email": "البريد الإلكتروني",
  "contact.form.message": "الرسالة",
  "contact.form.submit": "إرسال",

  "contact.featuredProject.title": "مشروع مميز: عيادة د. رضواني البيطرية",
  "contact.featuredProject.description": "لقد قمت بتطوير الباك‌اند والهندسة الكلية لموقع عيادة د. رضواني البيطرية. الموقع يتيح لأصحاب الحيوانات الأليفة الوصول السهل إلى الخدمات البيطرية، حجز المواعيد، والموارد التعليمية. دوري شمل إنشاء باك‌اند قابل للتوسع باستخدام Node.js وPython، وضمان تكامل API سلس وأمان في معالجة البيانات."
}
