{
  "nav.home": "Startseite",
  "nav.about": "Über mich",
  "nav.projects": "Projekte",
  "nav.contact": "Kontakt",

  "home.welcome": "Hallo! Ich bin Saeed AliShahbazi.",
  "home.description": "Ich bin ein Backend-Entwickler mit Fokus auf JavaScript, Node.js und Python. Für mich bedeutet Programmieren mehr als nur Code zu schreiben – es geht darum, präzise, wartbare und zuverlässige Lösungen für reale Herausforderungen zu schaffen.\n\nIch lege großen Wert auf sauberen, strukturierten und gut dokumentierten Code. Ich arbeite professionell mit Git und GitHub, mache sinnvolle Commits und halte meine Branches organisiert.\n\nIch entwerfe Systeme, die skalierbar, wartbar und verständlich sind. Zu meinen Fähigkeiten gehören API-Entwicklung, Datenbankmanagement und professionelle Dokumentation.\n\nMein Ziel ist es, auszuwandern und eine berufliche Perspektive im Ausland aufzubauen – in einem Umfeld, das Wachstum ermöglicht und Innovation fördert.\n\nIch schätze Zusammenarbeit, die auf Qualität, Transparenz und gegenseitigem Respekt basiert.",

  "about.title": "Über mich",
  "about.name": "Saeed AliShahbazi",
  "about.roles": "Backend-Entwickler | Dokumentationsliebhaber | Suchender nach Meisterschaft und Wachstum",
  "about.birthdate": "Geburtsdatum: 10. November 1998",

  "about.greeting": "Hallo. Ich bin nicht nur ein Entwickler, sondern ein Suchender, der die tiefen Strukturen von Systemen, Bewusstsein und Kreativität erforscht.",
  "about.childhood": "Schon als Kind war ich fasziniert von den unsichtbaren Mustern, die die Realität formen – ob in Computern oder in der menschlichen Psyche. Diese Neugier führte mich sowohl zur Technologie als auch zur inneren Wahrheit.",

  "about.learningPath": "Mein Lernweg",
  "about.learningDesc": "Meine Reise begann mit Backend-Technologien – zuerst mit Node.js, später auch mit Python. Ich lernte, wie man APIs entwickelt, Datenbanken verwaltet und automatisierte Workflows erstellt – und wie man Code schreibt, der robust, lesbar und testbar ist.",
  "about.tools": "Ich beherrsche Tools wie Git, GitHub, Postman, VS Code, Linux, REST-APIs und Paketmanager wie npm, yarn und pip. Saubere Commits, sinnvolle Branches und präzise Dokumentation gehören zu meiner professionellen Haltung.",
  "about.pythonDesc": "Python ist meine zweite starke Sprache. Ich nutze es für Automatisierung, Backend-Prozesse und bald auch für Datenverarbeitung, ETL und Skripterstellung.",

  "about.beliefsTitle": "Werte und Überzeugungen",
  "about.beliefsDesc": "Softwareentwicklung ist für mich nicht nur ein Beruf, sondern ein Weg zu Klarheit, Disziplin und Integrität. Ich betrachte Code als lebendiges System – er braucht Pflege, Verbindung und bewusstes Design. Ich glaube an Wachstum durch Struktur, innere Arbeit und kontinuierliches Reflektieren – im Code wie im Selbst.",

  "about.devMeans": "Was bedeutet Entwicklung für mich?",
  "about.commitment": "Ich bin verpflichtet, sauberen, modularen und skalierbaren Code zu schreiben, der sowohl die Bedürfnisse der Nutzer erfüllt als auch langfristig wartbar ist.",
  "about.communication": "Für mich ist klare, respektvolle und lösungsorientierte Kommunikation essenziell.",
  "about.responsibility": "Ich übernehme Verantwortung für die Systeme, die ich baue, und verbessere sie kontinuierlich mit Intention und Achtsamkeit.",

  "about.goalsTitle": "Ziele und Zukunftsvision",
  "about.goalsDesc": "Ich strebe eine ortsunabhängige, sinnvolle Karriere an. Ich suche nach Freelance- oder Remote-Möglichkeiten, die auf Innovation, Qualität und ethischer Ausrichtung basieren.",
  "about.environmentDesc": "Ich arbeite gerne in Teams, die kreative Autonomie, strukturiertes Lernen und psychologische Sicherheit wertschätzen – besonders in multikulturellen, bewussten Umfeldern.",

  "about.whyWorkWithMeTitle": "Warum mit mir arbeiten?",
  "about.whyWorkWithMe1": "Ich kombiniere technische Präzision mit philosophischer Tiefe und psychologischer Klarheit.",
  "about.whyWorkWithMe2": "Ich bringe sowohl fokussierte Selbstständigkeit als auch Bereitschaft zur offenen Zusammenarbeit mit.",
  "about.whyWorkWithMe3": "Ich liefere hochwertige, zukunftsfähige Lösungen mit Liebe zum Detail.",
  "about.whyWorkWithMe4": "Ich lege Wert auf sinnvolle Arbeit, gemeinsames Wachstum und authentische Resultate.",

  "projects.title": "Projekte",
  "projects.intro": "Hier finden Sie eine Auswahl meiner Projekte. Alle wurden sorgfältig entwickelt, um reale Bedürfnisse abzudecken und langfristig wartbar zu sein.",

  "projects.project1.title": "API-Management-System",
  "projects.project1.description": "Ein RESTful-Service, entwickelt mit Node.js und Express, konzipiert zur Verwaltung dynamischer Daten. Fokus auf Skalierbarkeit und Sicherheit.",

  "projects.project2.title": "Backend-Automatisierung mit Python",
  "projects.project2.description": "Eine Sammlung von Python-Skripten zur Automatisierung von Datenverarbeitung und Workflows, einschließlich ETL-Prozessen.",

  "projects.project3.title": "Dokumentation von Entwicklungsprojekten",
  "projects.project3.description": "Erstellung umfassender Dokumentationen für Softwareprojekte mit Schwerpunkt auf Lesbarkeit und Verständlichkeit für Entwickler und Stakeholder.",

  "projects.callToAction": "Wenn Sie an einer Zusammenarbeit interessiert sind oder ein Projekt besprechen möchten, kontaktieren Sie mich bitte.",

  "contact.title": "Kontakt",
  "contact.description": "Zögern Sie nicht, mich zu kontaktieren, um Projekte, Kooperationen oder Fragen zu besprechen.",
  
  "contact.form.name": "Name",
  "contact.form.email": "E-Mail",
  "contact.form.message": "Nachricht",
  "contact.form.submit": "Senden",

  "contact.featuredProject.title": "Ausgewähltes Projekt: Dr. Rezvani Veterinärklinik",
  "contact.featuredProject.description": "Ich habe das Backend und die Architektur für die Website der Dr. Rezvani Veterinärklinik entwickelt. Die Seite bietet Tierhaltern einfachen Zugang zu veterinärmedizinischen Dienstleistungen, Terminvereinbarungen und Informationsressourcen. Meine Rolle umfasste die Erstellung eines skalierbaren Backends mit Node.js und Python, die Sicherstellung einer reibungslosen API-Integration und die sichere Datenverarbeitung."
}
