{
  "nav.home": "خانه",
  "nav.about": "درباره من",
  "nav.projects": "پروژه‌ها",
  "nav.contact": "تماس",

  "home.welcome": "سلام! من سعید علی‌شهبازی هستم.",
  "home.description": "من توسعه‌دهنده‌ی بک‌اند هستم با تمرکز بر JavaScript، Node.js و Python. برای من برنامه‌نویسی صرفاً نوشتن کد نیست؛ بلکه خلق راه‌حل‌هایی دقیق، نگهدارپذیر و قابل اعتماد برای مسائل دنیای واقعی است.\n\nهمیشه اولویت من نوشتن کدی تمیز، ساخت‌یافته و مستندسازی‌شده بوده است. در استفاده‌ی حرفه‌ای از Git و GitHub مهارت دارم و تغییرات معنادار را با شاخه‌های منظم ثبت می‌کنم.\n\nمن سیستم‌هایی طراحی می‌کنم که مقیاس‌پذیر، قابل فهم و قابل نگهداری هستند. مهارت‌هایم شامل توسعه API، مدیریت پایگاه داده و مستندسازی حرفه‌ای است.\n\nهدفم مهاجرت و ساخت اقامت کاری در خارج از کشور است؛ جایی که بتوانم رشد کنم و فرصت‌های نوآورانه‌ را دنبال کنم.\n\nبه همکاری‌هایی متعهد هستم که بر پایه‌ی کیفیت، شفافیت و احترام متقابل باشند.",

  "about.title": "درباره من",
  "about.name": "سعید علی‌شهبازی",
  "about.roles": "توسعه‌دهنده بک‌اند | عاشق مستندسازی | جوینده‌ی رشد و تسلط",
  "about.birthdate": "تولد: ۱۹ آبان ۱۳۷۷",

  "about.greeting": "سلام. من فقط یک توسعه‌دهنده نیستم، بلکه جوینده‌ای هستم که ساختارهای عمیق سیستم‌ها، آگاهی و خلاقیت را کاوش می‌کنم.",
  "about.childhood": "از کودکی، مجذوب چارچوب‌های نادیده‌ای بودم که واقعیت را شکل می‌دهند؛ چه سیستم‌های منطقی در رایانه و چه الگوهای کهن‌الگوی روان. من با همان اشتیاق هم تکنولوژی را دنبال کردم و هم حقیقت درونی را.",

  "about.learningPath": "مسیر یادگیری من",
  "about.learningDesc": "سفر من با غوطه‌وری در فناوری‌های بک‌اند آغاز شد، از Node.js شروع شد و به Python رسید. یاد گرفتم چگونه API بسازم، با پایگاه‌داده‌ها کار کنم و جریان‌های کاری را خودکار کنم، و نیز چگونه کدی بنویسم که پایدار، خوانا و قابل تست باشد.",
  "about.tools": "در ابزارهایی مانند Git، GitHub، Postman، VS Code، لینوکس، REST API و ابزارهای مدیریت پکیج مثل npm/yarn/pip تسلط دارم. کامیت‌های تمیز، شاخه‌بندی معنادار، و مستندسازی دقیق بخشی از اخلاق حرفه‌ای من هستند.",
  "about.pythonDesc": "Python زبان دوم قدرتمند من است. از آن برای اتوماسیون، جریان‌های بک‌اند، و به زودی برای پردازش داده، ETL و اسکریپت‌نویسی استفاده می‌کنم.",

  "about.beliefsTitle": "باورها و ارزش‌ها",
  "about.beliefsDesc": "توسعه برای من صرفاً شغل نیست؛ بلکه مسیری است برای وضوح، انضباط و یکپارچگی. من به کد مثل یک ارگانیسم زنده نگاه می‌کنم؛ نیازمند مراقبت، ارتباط و ساختار آگاهانه. به رشد از طریق نظم، کار درونی و بازنگری مداوم—در کد و در خود—باور دارم.",

  "about.devMeans": "توسعه نرم‌افزار برای من یعنی چه؟",
  "about.commitment": "متعهد به نوشتن کدی تمیز، ماژولار و مقیاس‌پذیر هستم که هم نیاز کاربر را برآورده کند و هم در بلندمدت قابل نگهداری باشد.",
  "about.communication": "برای من ارتباط شفاف، محترمانه و راه‌حل‌محور ارزشمند است.",
  "about.responsibility": "مالکیت پروژه‌هایی را که طراحی می‌کنم می‌پذیرم و به‌صورت پیوسته آن‌ها را با نیت و آگاهی بهبود می‌دهم.",

  "about.goalsTitle": "چشم‌انداز و اهداف آینده",
  "about.goalsDesc": "هدف من ساخت یک مسیر شغلی مستقل از مکان و هم‌راستا با روح است. به دنبال همکاری‌های فریلنس و موقعیت‌های دورکاری هستم که با نوآوری، کیفیت و هم‌راستایی اخلاقی هماهنگ باشند.",
  "about.environmentDesc": "تمایل دارم در تیم‌هایی فعالیت کنم که خودمختاری خلاق، یادگیری ساخت‌یافته و امنیت روانی را ارج می‌نهند. به‌ویژه به محیط‌های چندفرهنگی و سیستم‌هایی علاقه دارم که کار آگاهانه را حمایت می‌کنند.",

  "about.whyWorkWithMeTitle": "چرا با من کار کنید؟",
  "about.whyWorkWithMe1": "من دقت فنی را با عمق فلسفی و وضوح روان‌شناختی تلفیق می‌کنم.",
  "about.whyWorkWithMe2": "در هر پروژه هم تمرکز مستقل دارم و هم آمادگی برای همکاری باز.",
  "about.whyWorkWithMe3": "کدی با کیفیت، با ذهنیت بلندمدت و توجه به جزئیات ارائه می‌دهم.",
  "about.whyWorkWithMe4": "عمیقاً به کار معنادار، رشد متقابل و نتایج هم‌راستا اهمیت می‌دهم."
}
