{
  "nav.home": "خانه",
  "nav.about": "درباره من",
  "nav.projects": "پروژه‌ها",
  "nav.contact": "تماس",

  "home.welcome": "سلام! من سعید علی‌شهبازی هستم.",
  "home.description": "من توسعه‌دهنده بک‌اند و فرانت‌اند هستم با تمرکز روی JavaScript، Node.js و Python. برای من برنامه‌نویسی فراتر از نوشتن کد است؛ این یعنی خلق راهکارهای دقیق، قابل نگهداری و قابل اعتماد برای چالش‌های واقعی.\n\nهمیشه به نوشتن کد تمیز، ساختاریافته و مستند اهمیت داده‌ام. از Git و GitHub به صورت حرفه‌ای استفاده می‌کنم، تغییرات معنادار را کامیت می‌کنم و شاخه‌ها را به خوبی مدیریت می‌کنم.\n\nسیستم‌هایی طراحی می‌کنم که مقیاس‌پذیر، قابل نگهداری و قابل فهم باشند. مهارت‌های من شامل توسعه API، مدیریت پایگاه داده و مستندسازی حرفه‌ای است.\n\nهدفم مهاجرت و تثبیت اقامت کاری در خارج از کشور است، جایی که بتوانم در محیطی حرفه‌ای رشد کنم و فرصت‌های نوآورانه را دنبال کنم.\n\nبرای من همکاری‌هایی که بر اساس کیفیت، شفافیت و احترام متقابل باشد ارزشمند است.",

  "about.title": "درباره من",
  "about.name": "سعید علی‌شهبازی",
  "about.roles": "توسعه‌دهنده بک‌اند و فرانت‌اند | علاقه‌مند به مستندسازی | جویای کمال",
  "about.birthdate": "تولد: ۱۹ آبان ۱۳۷۷",
  "about.greeting": "سلام و درود. من فقط یک توسعه‌دهنده نیستم، بلکه یک جوینده‌ام — کسی که به معماری عمیق سیستم‌ها، آگاهی و خلاقیت می‌پردازد.",
  "about.childhood": "از کودکی جذب ساختارهای نامرئی‌ای شدم که واقعیت را اداره می‌کنند — چه سیستم‌های منطقی در کامپیوترها و چه الگوهای آرکه‌تایپی در روان. با همان کنجکاوی هم فناوری را دنبال کردم هم حقیقت درون را.",
  "about.learningPath": "مسیر یادگیری من",
  "about.learningDesc": "سفر من با ورود عمیق به فناوری‌های بک‌اند آغاز شد، ابتدا با Node.js و سپس Python. یاد گرفتم چگونه API بسازم، با دیتابیس کار کنم و جریان‌های کاری را اتوماتیک کنم — همچنین چطور کدی پایدار، خوانا و قابل تست بنویسم.",
  "about.tools": "مهارت من شامل Git، GitHub، Postman، VS Code، لینوکس، REST APIها و مدیر بسته‌هایی مثل npm/yarn/pip است. من به کامیت‌های تمیز، شاخه‌بندی معنادار و مستندسازی دقیق به عنوان بخشی از اخلاق توسعه‌دهنده اهمیت می‌دهم.",
  "about.pythonDesc": "پایتون به زبان دوم قدرتمند در پشته من تبدیل شده است. آن را برای اتوماسیون، جریان‌های کاری بک‌اند و به زودی برای کارهای داده‌ای (خطوط ETL، اسکریپت‌نویسی و تبدیل داده) استفاده می‌کنم.",
  "about.beliefsTitle": "اعتقادات و ارزش‌ها",
  "about.beliefsDesc": "برای من توسعه فقط یک شغل نیست — بلکه مسیری است برای وضوح، انضباط و همگرایی. کدبیس‌ها را مثل موجودات زنده می‌بینم: نیازمند مراقبت، ارتباط و ساختار آگاهانه‌اند. به رشد از طریق ساختار، کار درون و بازفاکتورینگ مداوم — هم در کد و هم در خود — ایمان دارم.",
  "about.devMeans": "توسعه برای من چه معنایی دارد",
  "about.commitment": "متعهد هستم کد تمیز، ماژولار و مقیاس‌پذیر بنویسم که هم نیازهای کاربران و هم نگهداری بلندمدت را تامین کند.",
  "about.communication": "ارتباطی شفاف، محترمانه و هدفمند به سمت راه‌حل‌های مشترک را ارزشمند می‌دانم.",
  "about.responsibility": "مسئولیت سیستم‌هایی که طراحی می‌کنم را می‌پذیرم و آن‌ها را با نیت و آگاهی بهبود می‌بخشم.",
  "about.goalsTitle": "چشم‌انداز و اهداف آینده",
  "about.goalsDesc": "هدف من ساختن یک حرفه مستقل از مکان و مبتنی بر معنویت است. دنبال همکاری‌های فریلنس و موقعیت‌های دورکاری هستم که با نوآوری، کیفیت و ارزش‌های اخلاقی همسو باشد.",
  "about.environmentDesc": "آرزو دارم به تیم‌هایی ملحق شوم که استقلال خلاقانه، یادگیری ساختاریافته و امنیت روانی در آن‌ها امری عادی باشد. به ویژه محیط‌های چندفرهنگی و سیستم‌هایی که کار آگاهانه را پشتیبانی می‌کنند برایم جذاب است.",
  "about.whyWorkWithMeTitle": "چرا با من کار کنید؟",
  "about.whyWorkWithMe1": "من دقت فنی را با عمق فلسفی و وضوح روانشناختی تلفیق می‌کنم.",
  "about.whyWorkWithMe2": "هم تمرکز مستقل و هم گشایش همکاری را در هر پروژه به ارمغان می‌آورم.",
  "about.whyWorkWithMe3": "کد با کیفیت و با ذهنیت بلندمدت و توجه به جزئیات ارائه می‌دهم.",
  "about.whyWorkWithMe4": "برای کار معنادار، رشد متقابل و نتایج هماهنگ عمیقاً اهمیت قائلم.",

  "projects.title": "پروژه‌های من",
  "projects.intro": "در اینجا مجموعه‌ای از پروژه‌های کلیدی من را می‌بینید که هرکدام با دقت ساخته شده‌اند تا چالش‌های دنیای واقعی را حل کنند و تاثیر ماندگاری از طریق توسعه قدرتمند بک‌اند و فرانت‌اند ایجاد کنند.",

  "projects.project1.title": "dr-rezvani-vet.ir",
  "projects.project1.description": "من معمار و توسعه‌دهنده راهکار کامل فول‌استک برای کلینیک دامپزشکی دکتر رضوانی بوده‌ام، پلتفرمی چندزبانه و یکپارچه که دسترسی آسان به خدمات دامپزشکی را برای صاحبان حیوانات فراهم می‌کند. این پروژه دارای طراحی کاملاً واکنش‌گرا، سیستم نوبت‌دهی کاربرپسند و رابط کاربری تمیزی است که با هویت برند کلینیک هم‌راستا است. بک‌اند از Node.js و Python بهره می‌برد تا مقیاس‌پذیری، امنیت و یکپارچگی روان API را تضمین کند.",
  "projects.project1.link": "بازدید از سایت",

  "projects.project2.title": "API چت بلادرنگ (Node.js و WebSockets)",
  "projects.project2.description": "یک بک‌اند چت با کارایی بالا و مقیاس‌پذیر با استفاده از فناوری WebSocket توسعه دادم که امکان حضور کاربران به صورت بلادرنگ، ماندگاری پیام‌ها و نقاط انتهایی RESTful قوی را فراهم می‌کند. این API تعامل روان بین کلاینت‌ها را با مدیریت حالت کارآمد و تحمل خطا پشتیبانی می‌کند.",

  "projects.project3.title": "اسکریپت‌های اتوماسیون داده (Python)",
  "projects.project3.description": "مجموعه‌ای از اسکریپت‌های Python برای اتوماتیک‌سازی جریان‌های کاری مهم پردازش داده، شامل تجزیه CSV، خطوط ETL و وظایف استقرار ایجاد کردم. این ابزارها به طور قابل توجهی تلاش دستی را کاهش داده و قابلیت اطمینان و ثبات عملیات بک‌اند را افزایش می‌دهند.",

  "projects.project4.title": "داشبورد تعاملی (فرانت‌اند)",
  "projects.project4.description": "یک اپلیکیشن داشبورد مدرن و واکنش‌گرا با استفاده از فریم‌ورک‌های پیشرفته JavaScript ساختم. این داشبورد داده‌های API پویا، نمودارهای بصری و اجزای UI تعاملی را برای ارائه بینش‌های کسب‌وکاری عملی با تجربه کاربری روان یکپارچه می‌کند.",

  "contact.description": "برای بحث در مورد پروژه‌ها، همکاری‌ها یا هر سوالی، لطفاً تماس بگیرید.",
  "contact.form.name": "نام",
  "contact.form.email": "ایمیل",
  "contact.form.message": "پیام",
  "contact.form.submit": "ارسال",

  "contact.featuredProject.title": "پروژه ویژه: کلینیک دامپزشکی دکتر رضوانی",
  "contact.featuredProject.description": "من معماری کلی و بک‌اند وب‌سایت کلینیک دامپزشکی دکتر رضوانی را توسعه دادم. این سایت دسترسی آسان به خدمات دامپزشکی، رزرو وقت و منابع آموزشی را برای صاحبان حیوانات فراهم می‌کند. نقش من شامل ایجاد بک‌اند مقیاس‌پذیر با Node.js و Python، تضمین یکپارچگی روان API و مدیریت امن داده‌ها بود."
}
